// Реалізуй клас, що описує коло. У класі повинні бути такі компоненти:
// поле, що зберігає радіус кола;
// get-властивість, яке повертає радіус кола;
// set-властивість, що встановлює радіус кола;
// get-властивість, яке повертає діаметр кола;
// метод, що обчислює площу кола;
// метод, що обчислює довжину кола.
// Продемонструй роботу властивостей і методів.

class circle {
  constructor(radius) {
    this.radius = 10;
  }
  get Radius() {
    return `Радіус кола: ${this.radius}`;
  }
  set Radius(radius) {
    this.radius = 20;
  }
}
console.log(circle);